{"name": "ARTS", "children": [{"name": "Architecture", "description": "Related to how the service is architected and likely where any work to fix would require changes to the architecture of the service", "children": [{"name": "BlastRadius", "description": "The current architecture does not allow for the most blast radius reduction, or there is another issue related to the blast radius of the impact"}, {"name": "Caching", "description": "Related to the lack of or insufficient caching patterns or the presence of any caching anti-patterns"}, {"name": "ColdStart", "description": "An issue related to cold start"}, {"name": "Config", "description": "See child's description", "children": [{"name": "Others", "description": "This is a placeholder for any configuration related issue that is not covered in the above tags. The outages assigned under this should be reviewed periodically so that meaningful tags can be created and assigned as needed. "}]}, {"name": "Database", "description": "Related to the way a database was integrated into the overall architecture or design of the service or specific scenario", "children": [{"name": "Change", "description": "A change to the database was a factor"}, {"name": "Deadlock", "description": "An issue related database deadlocks"}, {"name": "InconsistentDBSettings", "description": "The settings for the database(s) were inconsistent, leading to a runtime situation where different behavior existed for the instance(s)"}]}, {"name": "DesignLimitation", "description": "There is a limitation in the current design of the service that prevents that part of the architecture to adequately perform it's role or be changed to adapt to new conditions"}, {"name": "DesignReview", "description": "An issue related to missing design review"}, {"name": "DNS", "description": "Related to the way DNS was integrated into the overall architecture or design of the service or specific scenario", "children": [{"name": "Change", "description": "A change related to the DNS settings or the code that handles DNS integration for the service"}, {"name": "Latent", "description": "The issue was not caused solely by a code or configuration change"}]}, {"name": "DOS", "description": "An issue related to an architectural condition that creates a possible Denial of Service, but not necessarily one related to increased load"}, {"name": "FeatureFlag", "description": "An issue related to the use of feature flags"}, {"name": "http", "description": "See child's description", "children": [{"name": "sys", "description": "The service uses http.sys, which is not recommended, or the issue is related to how the service currently uses http.sys"}]}, {"name": "HyperV", "description": "Related to how the service uses HyperV"}, {"name": "InsufficientFailOver", "description": "An issue related to insufficient fail over"}, {"name": "Linux", "description": "Related to how the service uses Linux, or to indicate lack of Linux support for the solution"}, {"name": "LoadBalancing", "description": "Related to how the service balances load"}, {"name": "NoAutoFailover", "description": "The service did not or cannot fail over effectively from one region to another"}, {"name": "NoCanaryEnvironment", "description": "The service does not have a Canary environment, or the existing one is insufficient"}, {"name": "NoCircuitBreaker", "description": "The service continued to execute expensive operations when it should not have"}, {"name": "NoSoftDelete", "description": "The issue could have been mitigated by implementation of a Soft Delete pattern, or where the existing Soft Delete pattern was insufficient"}, {"name": "PlatformGap", "description": "There is a platform gap that should be filled.  Use a third-level-tag to name the service owning the gap"}, {"name": "Quorum", "description": "Related to insufficient quorum selection"}, {"name": "RegionsInconsistent", "description": "The service's regions are insufficient to be used interchangeably or there is another difference that prevents regions from delivering consistent behavior", "children": [{"name": "SKUMismatch", "description": "The inconsistent region was due to a SKU mismatch"}]}, {"name": "ReplicationLag", "description": "An issue related to replication log"}, {"name": "Resiliency", "description": "The service is lacking adequate overall resiliency", "children": [{"name": "CircularDependency", "description": "The service either prevents or is prevented from recovering because it depends on a service that depends on it at the same time either in sum or for a specific recovery scenario"}]}, {"name": "Security", "description": "An issue related to security"}, {"name": "SNAT", "description": "Related to how the service uses SNAT"}, {"name": "Snowflake", "description": "The service is architected in a very unusual way"}, {"name": "SPOF", "description": "The service has a single point of failure  ( SPOF ) that causes impact if a trigger event causes it to malfunction or not function", "children": [{"name": "Config", "description": "The single point of failure  ( SPOF ) is due to configuration, and SDP is not used"}, {"name": "ControlPlane", "description": "The single point of failure is in the service's control plane"}, {"name": "Dependency", "description": "The single point of failure  ( SPOF ) is another service or other dependency"}, {"name": "External", "description": "The single point of failure is external to Microsoft"}, {"name": "SharedIdentity", "description": "The single point of failure is a shared identity"}, {"name": "Singleton", "description": "The single point of failure ( SPOF ) is a single instance of something"}]}, {"name": "SystemsOfControl ", "description": "Additional guardrails are needed to keep our engineers safe from performing actions with unintended consequences"}]}, {"name": "Auth", "description": "An authentication or authorization related issue", "children": [{"name": "AAD", "description": "See child's description", "children": [{"name": "Authentication", "description": "An issue related to authentication using Azure Active Directory"}]}, {"name": "Cert", "description": "Related to any certificate code, configuration, or ability to authenticate using the certificate infrastructure owned by Microsoft", "children": [{"name": "AllowListing", "description": "An issue caused by failure of, improper use, or change to an allow list"}, {"name": "Change", "description": "Related to a change in the certificate code, configuration or a rotation"}, {"name": "CodeBug", "description": "A bug in non-platform cert management / handling Authoring.Code."}, {"name": "Expiry", "description": "Any outage where an expired certificate contributed to or caused the impact"}, {"name": "ManualRotation", "description": "An issue related to manual rotation of a certificate"}, {"name": "MissingPrerequisite", "description": "A condition required for successful use of a certificate was missing"}, {"name": "NotAzure", "description": "Related to any certificate code, configuration, or ability to authenticate using the certificate infrastructure owned by a non-Microsoft entity"}, {"name": "ProvisioningFailure", "description": "The client failed because it was unable to get a certificate or it’s chain. If the service is using the platform (AKV / dSMS + KV VM ext / ACMS Agent + OneCert), then it’s our problem to fix. If the service is using their own cert distribution solution or cert binding solution, then it’s the service’s problem"}, {"name": "ProvisioningMistake", "description": "Human error resulted in the a bad cert, a cert with missing properties, a cert from an unsupported PKI."}, {"name": "RevocationCheckFailed", "description": "The client fails because it is not able to validate the revocation status of a certificate. This is usually because the CRL or OCSP endpoints that contain the revocation status are unreachable."}, {"name": "ThumbprintPinning", "description": "Any time a client expects the certificate to have a specific value but it doesn’t. This could be thumbprint pinning, it could be a specific subject name or serial number, or any other property of the certificate"}]}, {"name": "Password", "description": "See child's description", "children": [{"name": "Change", "description": "An issue caused by changing of a password"}]}, {"name": "Secrets", "description": "An issue related to secrets management", "children": [{"name": "Keys", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to a change in secret keys"}, {"name": "Expiry", "description": "A key secret expired"}, {"name": "Rotation", "description": "An issue related to rotation of secrets keys"}]}, {"name": "ManualChange", "description": "An issue related to manual change to a secret"}, {"name": "Permission", "description": "Secrets could not be accessed due to a permission issue"}, {"name": "RubyScriptExpiry", "description": "A secret required for execution of a Ruby script expired"}, {"name": "SubscriptionExpiry", "description": "Any outage where an expired subscription contributed to or caused the impact"}, {"name": "TokenExpiry", "description": "An issue related to expiration of a token"}]}, {"name": "Software", "description": "See child's description", "children": [{"name": "LicenseExpiry", "description": "An issue caused by expiration of a license the service uses"}]}]}, {"name": "Authoring", "description": "Issues related to authoring things like code, config, TSGs etc... ", "children": [{"name": "Code", "description": "See child's description", "children": [{"name": "BackwardCompatibility ", "description": "An issue related to the deployed code not being backwards compatible with older versions"}, {"name": "BadMerge", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to a merge of code check-ins"}]}, {"name": "Bug", "description": "A bug was introduced in the authoring process of the code", "children": [{"name": "AtScale", "description": "A bug introduced in the authoring process of code that only shows up when the service was actually run at a higher scale "}, {"name": "Change", "description": "A bug was introduced in the authoring process of the code"}, {"name": "Latent", "description": "A bug existed but some other combination of events exposed it"}, {"name": "OpsTool", "description": "An issue related to a bug in a tool used by the service, operation or other team"}, {"name": "RaceCondition", "description": "A bug was present which either only showed up in a race condition or created a race condition itself"}]}, {"name": "Change", "description": "An issue related to a change in the service code"}, {"name": "CodeReview", "description": "An issue related to the code review process"}, {"name": "Flighting", "description": "An issue related to the way code versions are flighted"}, {"name": "Fuzzing", "description": "Tagged when an opportunity to use fuzzing to detect problems may exist"}, {"name": "InsufficientRetryLogic", "description": "An issue related to when the service uses a retry pattern when appropriate, but the implementation is insufficient "}, {"name": "Latent", "description": "A latent issue in the code that was exposed to a change elsewhere"}, {"name": "NoRetryLogic", "description": "The service should be using retry pattern when called for, but is not "}, {"name": "SharedCodeBase", "description": "See child's description", "children": [{"name": "Change", "description": "A change was made in a shared code base"}]}, {"name": "VersionMismatch", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to any mismatch of versions of code or code libraries"}]}]}, {"name": "Config", "description": "An issue related to authoring a configuration.", "children": [{"name": "Change", "description": "A change was made to a configuration of any kind"}, {"name": "ConfigReview", "description": "An issue related to the config review process"}, {"name": "Consumption", "description": "See child's description", "children": [{"name": "DataSerialization", "description": "Parser could not parse the config file   "}]}, {"name": "Distribution", "description": "See child's description", "children": [{"name": "IncorrectScope ", "description": "Scope of the variable was set incorrectly e.g. Variable value was supposed to be read from the Tenant level and not global level or vice versa.   "}]}, {"name": "FeatureFlag", "description": "The updates were not available because someone forgot to update or remove the Feature flag causing code deployment/initiation issues.  "}, {"name": "InvalidValue", "description": "Incorrect value or data type was entered"}, {"name": "Latent", "description": "A latent configuration issue that was not caused by change to the config"}, {"name": "MissingValidation", "description": "An issue related to not validating a config properly"}, {"name": "NetworkRouter", "description": "Any outage that is caused by changes in the config related to router settings or has the words PhyNet, Router Config, BGP should be tagged with this"}, {"name": "Others", "description": "This tag should be applied if the existing configuration tags cannot be applied since they do not cover the root cause. The outages with this tag will be evaluated to see if a new tag needs to be created or existing tags needs to have a better definition."}, {"name": "SchemaRule", "description": "The schema of the config file was incorrect or missing e.g. Incorrect casing was used e.g., Prd05ChApp instead of prd05chapp or decimal value was entered when integer was expected etc."}, {"name": "StructureError", "description": "The section of new configuration value was entered under a wrong section.    "}, {"name": "MissingValue", "description": "Missing expected value(s) or argument(s)"}]}, {"name": "Documentation", "description": "There was a documentation gap, mistake or other issue in something that is authored", "children": [{"name": "Cert", "description": "An issue related to documentation about the service's usage of certificates "}, {"name": "MissingTsgId", "description": "The Trouble Shooting Guide ID was missing"}, {"name": "NoOrInsufficientTSG", "description": "The DRI either lacked or had an insufficient Trouble Shooting Guide in terms of accuracy as well as efficiency"}, {"name": "S360", "description": "An issue related to working on an S360 task, such as having improper instructions in the S360 wiki document"}, {"name": "Tools", "description": "An issue related to documentation about the service's usage of tools"}]}, {"name": "RunBook", "description": "See child's description", "children": [{"name": "Insufficient", "description": "The DRI  had an insufficient runbook in terms of accuracy as well as efficiency"}, {"name": "InsuffientForAirGapped", "description": "The DRI  had an insufficient runbook for Air Gapped Cloud in terms of accuracy as well as efficiency"}, {"name": "Missing", "description": "The DRI lacked runbook in terms of accuracy as well as efficiency"}, {"name": "NeedsExecutable", "description": "The DRI had lacked executable runbook in terms of accuracy as well as efficiency"}, {"name": "Stale", "description": "The DRI had a stale runbook in terms of accuracy as well as efficiency"}, {"name": "WrongInfo", "description": "The DRI had incorrect information in the runbook in terms of accuracy as well as efficiency"}]}]}, {"name": "Datacenter", "description": "See child's description", "children": [{"name": "BuildOut", "description": "See child's description", "children": [{"name": "MissedValidation", "description": "When building out a new region or zone, there was an error, missing step or missing validation resulting in impactful non-conformity"}]}, {"name": "BuildOutError", "description": "When building out a new region or zone, there was an error, missing step or other issue resulting in impactful non-conformity", "children": [{"name": "SequenceNotAligned", "description": "When building out a new region or zone, there was sequence was not followed which resulting in impactful non-conformity"}]}, {"name": "Hardware", "description": "Related to hardware provided by or part of the datacenter", "children": [{"name": "EOL", "description": "Hardware that was past it's End Of Life date contributed to impact"}]}, {"name": "Network", "description": "Catch all for networking related issues not defined with a third level tags", "children": [{"name": "Capacity", "description": "Network capacity was exceeded, or otherwise insufficient"}, {"name": "Change", "description": "An issue related to a change in the service's networking"}, {"name": "Config", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to a change in the network configuration"}]}, {"name": "Driver", "description": "An issue related to a network driver, such as a code bug, outdated version etc…", "children": [{"name": "Change", "description": "An issue related to a network hardware driver installation update, change or removal"}]}, {"name": "FiberCut", "description": "Fiber connecting datacenters was severed"}, {"name": "Firewall", "description": "An issue related to an Incorrectly configured firewall"}, {"name": "Latency", "description": "A delay caused by the network as a whole"}, {"name": "PacketLoss", "description": "An issue caused by packet loss"}, {"name": "Port", "description": "An issue related to a network port"}]}, {"name": "Power", "description": "An issue related to interruption or other unavailability of power in the datacenter"}]}, {"name": "Dependency", "description": "Issues related to a dependency the service has, most typically another service but can also be some things where a boundary between teams is present", "children": [{"name": "AAD", "description": "An issue related to a dependency on Azure Active Directory"}, {"name": "AccountsManager", "description": "An issue related to a dependency on Accounts Manager"}, {"name": "ADAL", "description": "An issue related to a dependency on the Active Directory Authorization Library"}, {"name": "AppService", "description": "An issue related to a dependency on App Service"}, {"name": "ARM", "description": "An issue related to a dependency on Azure Resource Manager"}, {"name": "AtlasPlatfrom", "description": "An issue related to a dependency on Atlas Platform"}, {"name": "AzureCapacityInfrastructureService", "description": "An issue related to a dependency on Azure Capacity Infrastructure Service"}, {"name": "AzureCloudShell", "description": "An issue related to a dependency on AzureCloudShell"}, {"name": "AzureContainerInstances", "description": "An issue related to a dependency on Azure Container Instances"}, {"name": "AzureFilesService", "description": "An issue related to a dependency on Azure File Service"}, {"name": "AzureHostAgent", "description": "An issue related to a dependency on Azure Host Agent"}, {"name": "AzureKubernetesService", "description": "An issue related to a dependency on Azure Kubernetes Service"}, {"name": "AzureMonitorEssentials", "description": "An issue related to a dependency on Azure Monitor Essentials"}, {"name": "AzureMySQL", "description": "An issue related to a dependency on Azure MYSQL"}, {"name": "AzureNotificationService", "description": "An issue related to a dependency on Azure Notification Service"}, {"name": "AzureRT", "description": "An issue related to a dependency on Azure Run Time"}, {"name": "AzureSQLDB", "description": "An issue related to a dependency on Azure SQLDB"}, {"name": "BatchService", "description": "An issue related to a dependency on BatchService"}, {"name": "BuildNotificationService", "description": "An issue related to a dependency on Build Notification Service"}, {"name": "C++", "description": "An issue related to a dependency on C++"}, {"name": "Communication", "description": "A communication gap with a service dependency team contributed to a non-optimal TTM or otherwise affected the ability to resolve the issue in a timeline manner"}, {"name": "CosmosDB", "description": "An issue related to a dependency on Cosmos DB"}, {"name": "Database", "description": "See child's description", "children": [{"name": "Connection", "description": "An issue related to a dependency on Database Connection"}]}, {"name": "Databricks", "description": "An issue related to a dependency on Databricks"}, {"name": "DNS", "description": "An issue related to a dependency on DNS"}, {"name": "DotNet", "description": "An issue related to a dependency on DotNet"}, {"name": "dSMS", "description": "An issue related to a dependency on Datacenter Secrets Management Service"}, {"name": "dSTS", "description": "An issue related to a dependency on Datacenter Security Token Service"}, {"name": "Dynamics", "description": "An issue related to a dependency on Dynamics"}, {"name": "ESRP", "description": "An issue related to a dependency on Enterprise Security and Release Platform"}, {"name": "ESTS", "description": "An issue related to a dependency on Evolved Secure Token Service"}, {"name": "EventHub", "description": "An issue related to a dependency on Event Hub"}, {"name": "External", "description": "See child's description", "children": [{"name": "Akamai", "description": "An issue related to a dependency on External service Akamai"}, {"name": "AndroidSDK", "description": "An issue related to a dependency on External Service Android SDK"}, {"name": "Cerebata", "description": "An issue related to a dependency on External service Cerebeta"}, {"name": "Conda", "description": "An issue related to a dependency on External service Conda"}, {"name": "DigiCert", "description": "An issue related to a dependency on External service DigiCert"}, {"name": "DockerHub", "description": "An issue related to a dependency on External service Docker Hub"}, {"name": "GitHub", "description": "An issue related to a dependency on GitHub"}, {"name": "GoDaddy", "description": "An issue related to a dependency on External service GoDaddy"}, {"name": "Kubernetes", "description": "An issue related to a dependency on External service Kubernetes"}, {"name": "LinuxSecureBaseImage", "description": "An issue related to a dependency on External service Linux Secure Base Image"}, {"name": "MediaCreation", "description": "An issue related to a dependency on External service Media Creation"}, {"name": "OryxBuildImage", "description": "An issue related to a dependency on OryxBuildImage"}, {"name": "TelecommunicationProvider", "description": "An issue related to a dependency on External Tele Communication Provider"}, {"name": "TrelloApis", "description": "An issue related to a dependency on External service Trello Apis"}, {"name": "Ubuntu", "description": "An issue related to a dependency on External service Ubuntu"}]}, {"name": "Gateway", "description": "An issue related to a dependency on Gateway"}, {"name": "Geneva", "description": "An issue related to a dependency on Geneva"}, {"name": "KeyVault", "description": "An issue related to a dependency on Key Vault"}, {"name": "Kusto", "description": "An issue related to a dependency on Kusto"}, {"name": "LogicAppService", "description": "An issue related to a dependency on Logic App Service"}, {"name": "ManagedIdentityService", "description": "An issue related to a dependency on Managed Identity Service"}, {"name": "MarketPlace", "description": "An issue related to a dependency on Market Place"}, {"name": "MDS", "description": "An issue related to a dependency on MDS"}, {"name": "MicrosoftDigital", "description": "An issue related to a dependency on Microsoft Digital"}, {"name": "MicrosoftEmailOrchestration(MEO)", "description": "An issue related to a dependency on Microsoft Email Orchestration"}, {"name": "Network", "description": "An issue related to a dependency on the network"}, {"name": "NetworkConnectivity", "description": "An issue related to a dependency on Network Connectivity"}, {"name": "NetworkingResourceProvider", "description": "An issue related to a dependency on Networking Resource Provider"}, {"name": "Operations Management Suite (OMS)", "description": "An issue related to a dependency on Operations Management Suite (OMS)"}, {"name": "OSSDatabases", "description": "An issue related to a dependency on OSS Databases"}, {"name": "OSUpgrade", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to a change made to upgrade any operating system version"}]}, {"name": "Package", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to a change made in a package provided by or used to for a dependency"}]}, {"name": "PartnerTeam", "description": "An issue related to a dependency on Partner Team"}, {"name": "PlatformUpgrade", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to a change made to upgrade the version of any dependency considered a platform"}]}, {"name": "PolicyAdministrationService", "description": "An issue related to a dependency on Policy Administration Service"}, {"name": "PolicyAgent", "description": "An issue related to a dependency on Policy Agent"}, {"name": "Portal", "description": "An issue related to a dependency on Portal"}, {"name": "PowerApps", "description": "An issue related to a dependency on PowerApps"}, {"name": "PowerBI", "description": "See child's description", "children": [{"name": "Gateway", "description": "An issue related to a dependency on Power BI Gateway"}]}, {"name": "PowerShellAPI", "description": "An issue related to a dependency on Power Shall API"}, {"name": "PrivateLink", "description": "An issue related to a dependency on Private Link"}, {"name": "Purview", "description": "An issue related to a dependency on Purview"}, {"name": "RdAgent", "description": "An issue related to a dependency on RD Agent"}, {"name": "RedisCache", "description": "An issue related to a dependency on Redis Cachie"}, {"name": "RegionalNetworkManager", "description": "An issue related to a dependency on Regional Network Manager"}, {"name": "SDK", "description": "An issue related to a dependency on an SDK", "children": [{"name": "Cosmos", "description": "An issue related to a dependency on Cosmos SDK"}, {"name": "Storage", "description": "An issue related to a dependency on Storage SDK"}]}, {"name": "ServiceBus", "description": "An issue related to a dependency on Service Bus"}, {"name": "ServiceFabric", "description": "An issue related to a dependency on Service Fabric"}, {"name": "Services", "description": "See child's description", "children": [{"name": "CodeBug", "description": "An issue related to a code bug in a service dependency"}]}, {"name": "ServiceTreeEngineeringTeam", "description": "An issue related to a dependency on Service Tree Engineering Team"}, {"name": "ShortTimeout", "description": "See child's description", "children": [{"name": "TreatmentAssignmentService", "description": "An issue related to a short timeout period when  Treatment Assignment Service"}]}, {"name": "SimpleMailTransferProtocol", "description": "An issue related to a dependency on Simple Mail Transfer Protocol"}, {"name": "SQL", "description": "An issue related to a dependency on SQL"}, {"name": "SQLDB", "description": "An issue related to a dependency on SQLDB"}, {"name": "Storage", "description": "An issue related to a dependency on Storage"}, {"name": "SynapsePlatformService", "description": "An issue related to a dependency on Synapse Platform Service"}, {"name": "TrafficManager", "description": "An issue related to a dependency on TrafficManager"}, {"name": "TreatmentAssignmentService", "description": "An issue related to a dependency on the Treatment Assignment Service"}, {"name": "VMHardware", "description": "An issue related to a dependency on Virtual Machine Hardware"}, {"name": "VMSS", "description": "An issue related to a dependency on Virtual Machine Scale Sets"}, {"name": "WebRoleCloudService", "description": "An issue related to a dependency on Web Role Cloud Service"}]}, {"name": "Deployment", "description": "Issues related to deployment of code or config", "children": [{"name": "ARMManifest", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to a change in the ARM Manifest"}]}, {"name": "AZDeployer", "description": "An issue related to using AZ Deployer"}, {"name": "BlastRadius", "description": "See child's description", "children": [{"name": "Change", "description": "An change caused an increase in the blast radius of the impact"}]}, {"name": "Bypassed", "description": "See child's description", "children": [{"name": "PreProdEnvironment", "description": "Deployment was not deployed in Pre Prod Environments"}]}, {"name": "Concurrency", "description": "An issue related to concurrency between different deployments"}, {"name": "Config", "description": "See child's description", "children": [{"name": "CodeConfigVersionMismatch", "description": "This should be applied to instances when the outage was caused because the code version was not compatible with the configuration version e.g. During deployment to 4 regions one of the region had older code but the new configurations were deployed causing outage for that region since the configuration and the code were not compatible."}, {"name": "Consumption", "description": "See child's description", "children": [{"name": "DataSerialization", "description": "Parser could not parse the config file   "}, {"name": "Drift", "description": "Local configuration overrides are directly deployed creating drift between the as-built (the configuration deployed) and the configuration in the base systems of record e.g. someone made direct changes to the production config file but those changes were never merged into the master copy causing those changes to be overwritten when next configuration updates are deployed.  "}]}, {"name": "Distribution", "description": "See child's description", "children": [{"name": "IncompatibleVersion", "description": "Incorrect version of the config file was loaded e.g. with Release 80, instead of Version 5 config file, version 4 config was loaded. Configuration version needs to have an explicit version dependency against service (code) versions   "}]}]}, {"name": "ConflictingChanges", "description": "See child's description", "children": [{"name": "Change", "description": "Conflicting changes were made during a deployment"}]}, {"name": "Dependency", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to a change in a dependency"}]}, {"name": "Deployed", "description": "See child's description", "children": [{"name": "IncorrectPackage", "description": "Deployed incorrect package during a deployment"}]}, {"name": "DeploymentItself", "description": "See child's description", "children": [{"name": "Change", "description": "A change to the way deployment is done caused impact"}]}, {"name": "Environment", "description": "See child's description", "children": [{"name": "Canary", "description": "See child's description", "children": [{"name": "Mismatch", "description": "The service's Canary deployment does not match it's other regions in a way that meant it did not help detect the issue"}]}, {"name": "NationalCloud", "description": "See child's description", "children": [{"name": "Mismatch", "description": "The service's National deployment does not match it's other regions "}]}]}, {"name": "ManualTouch", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to any number of manual touches that changed the deployment"}]}, {"name": "MissingPrerequisite", "description": "See child's description", "children": [{"name": "Change", "description": "A change was made to a deployment and now a prerequisite is missing"}]}, {"name": "Mitigation", "description": "See child's description", "children": [{"name": "Failed", "description": "A mitigation applied during deployment was not effective"}, {"name": "ManualTouch", "description": "An issue related to a manual touch done specifically to mitigate something during a deployment"}, {"name": "NoRollback", "description": "No rollback path exists or the knowledge and tools for rolling back were insufficient"}, {"name": "RollbackChange", "description": "A change made to the way things roll back contributed to impact"}]}, {"name": "NoFeatureFlag", "description": "A feature flag that could have prevented the issue was missing"}, {"name": "Patching", "description": "An issue related to Patching"}, {"name": "RaceCondition", "description": "See child's description", "children": [{"name": "Change", "description": "An issue related to a race condition between two different deployments that must be synchronized caused by change"}, {"name": "Latent", "description": "An issue related to a race condition between two different deployments that must be synchronized that has existed"}]}, {"name": "Recovery", "description": "See child's description", "children": [{"name": "SoftDelete", "description": "An issue related to not having soft deletion when it would have helped reduce impact or time to recover"}]}, {"name": "SDP", "description": "An issue related to Safe Deployment Practices", "children": [{"name": "Cert", "description": "See child's description", "children": [{"name": "ByPassed", "description": "A cert deployment had one or more steps that bypassed safe deployment protections"}, {"name": "InsufficientBakeTime", "description": "The issue could have been caught if more time were allowed for it to hit a broader range of permutations through the system"}]}, {"name": "Code", "description": "An issue related to Safe Deployment Practices of code", "children": [{"name": "AvailabilityZone", "description": "An issue around the way the code can or cannot work when deployed into an availability zone"}, {"name": "Bypassed", "description": "A code deployment had one or more steps that bypassed safe deployment protections"}, {"name": "CaughtInCanary", "description": "The code deployment issue was detected in the Canary environment"}, {"name": "Flighting", "description": "Safe Deployment Practices were not followed when flighting changes during a deployment"}, {"name": "InsufficientBakeTime", "description": "The issue could have been caught if more time were allowed for it to hit a broader range of permutations through the system"}, {"name": "NoStandardTool", "description": "Non-standard or non-approved deployment tools were used"}, {"name": "NotCaughtInCanary", "description": "The issue was not caught in the Canary environment"}, {"name": "Secrets", "description": "An issue related to the way the code access or uses secrets"}, {"name": "StageGuidance", "description": "Proper guidance around how code deployments should advance through the various rings or stages was not followed"}, {"name": "Validation", "description": "An issue around the way the code is validated during deployment"}]}, {"name": "Config", "description": "An issue related to Safe Deployment Practices of config", "children": [{"name": "BreakGlass", "description": "Someone directly changed config on the target node(s) and broke the service. "}, {"name": "IncorrectVersionRollout", "description": "The incorrect version of the configuration file was rolled out e.g. team is in the process of rolling out code version N+1, a new configuration rollout against code version N was serialized behind the code rollout.  "}, {"name": "MissingSDP", "description": "Configuration deployment does not follow Safe Deployment Practices"}, {"name": "NoLKG", "description": "Covers cases where a service was not able to rollback a bad config in the target. "}]}]}, {"name": "SequenceNotAligned", "description": "An issue related to the sequence of steps in a deployment"}]}, {"name": "Detection", "description": "Issues related to detecting problems before they affect production", "children": [{"name": "Monitoring", "description": "Issues related to detecting issues with monitoring", "children": [{"name": "AlertDidNotFire", "description": "An alert that was correctly configured to detect the issue did not fire"}, {"name": "AlertTooSlow", "description": "An alert that was correctly configured arrived too late, or with impactful delay"}, {"name": "Bug", "description": "An issue related to a bug in monitoring"}, {"name": "CertDeployment", "description": "See child's description", "children": [{"name": "InsufficientHealthSignal", "description": "The Cert deployment did not encompass positive health signals from the target services and deployed the latest configuration causing failures.  "}]}, {"name": "CodeDeployment", "description": "See child's description", "children": [{"name": "InsufficientHealthSignal", "description": "The code deployment did not encompass positive health signals from the target services and deployed the latest configuration causing failures.  "}]}, {"name": "ConfigDeployment", "description": "See child's description", "children": [{"name": "InsufficientHealthSignal", "description": "The configuration deployment did not encompass positive health signals from the target services and deployed the latest configuration causing failures.  "}]}, {"name": "InCorrectThreshold", "description": "An alert threshold was set incorrectly, and did not detect the issue"}, {"name": "InsufficientTelemetry", "description": "An issue related to lack of signals"}, {"name": "MissingAlert", "description": "An alert is missing, but telemetry and signals exist", "children": [{"name": "Cert", "description": "An alert is missing during cert deployment, but telemetry and signals exist"}]}, {"name": "MissingCustomerScenario", "description": "Monitoring to detect a specific customer scenario is missing"}, {"name": "NoAutoTriage", "description": "Autotriage does not exist for the monitoring signals"}, {"name": "NoSLOInstrumentation", "description": "An SLO is missing"}, {"name": "PlatformGap", "description": "An issue related to a platform gap in monitoring"}, {"name": "Synthetic", "description": "An issue related to active monitoring", "children": [{"name": "MissingAlert", "description": "An issue related to active monitoring not having an alert "}]}, {"name": "WrongAlertSeverity", "description": "An otherwise correctly configured alert was set to the wrong severity"}]}, {"name": "Validation", "description": "See child's description", "children": [{"name": "BackwardCompatibility ", "description": "An issue related to not validating that something is backwards compatible before being put into production"}, {"name": "CanaryNotProd", "description": "The canary environment being used is not a production environment"}, {"name": "Cert", "description": "An issue related to not validating a certificate properly"}, {"name": "CertDeployment", "description": "See child's description", "children": [{"name": "MissingTest", "description": "A cert deployment validation that could have detected the issue was missing"}]}, {"name": "Chaos", "description": "Chaos testing may be able to detect or help measure impact and should be investigated as a means of validating behavior"}, {"name": "CodeDeployment", "description": "See child's description", "children": [{"name": "MissingTest", "description": "A code deployment validation that could have detected the issue was missing"}]}, {"name": "ConfigDeployment", "description": "See child's description", "children": [{"name": "MissingTest", "description": "A config deployment validation that could have detected the issue was missing"}]}, {"name": "FaultInjection", "description": "Fault Injection may be able to detect or help measure impact and should be investigated as a means of validating behavior"}, {"name": "ForwardCompatibility", "description": "The validation methods in place were not forward compatible"}, {"name": "Fuzzing", "description": "Fuzzing should be investigated as a way to help detect these types of issues"}, {"name": "IntegrationTest", "description": "See child's description", "children": [{"name": "Missing", "description": "An integration test that could have detected the issue was missing"}, {"name": "MissingEnvironment", "description": "An integration test that could have detected the issue was missing environment"}, {"name": "NotCaughtInCanary", "description": "The issue was not caught in the Canary environment or another environment that could have detected it before it impacted production"}, {"name": "NotRun", "description": "An integration test that could have detected the issue was not run"}, {"name": "ResultIgnored", "description": "An integration test result was ignored  that could have detected the issue"}]}, {"name": "ManualTest", "description": "See child's description", "children": [{"name": "Missing", "description": "A manual test that could have detected the issue was missing"}, {"name": "NotRun", "description": "A manual test that could have detected the issue was not run"}, {"name": "ResultIgnored", "description": "A manual test result was ignored  that could have detected the issue"}]}, {"name": "MissingIntegrationTesting", "description": "An integration test that could have detected the issue was missing"}, {"name": "MissingPostBuild", "description": "See child's description", "children": [{"name": "Testing", "description": "A Post Build test that could have detected the issue was missing"}]}, {"name": "MissingPreProduction", "description": "See child's description", "children": [{"name": "Testing", "description": "A Pre Production test that could have detected the issue was missing"}]}, {"name": "MissingProduction", "description": "See child's description", "children": [{"name": "Testing", "description": "A Production test that could have detected the issue was missing"}]}, {"name": "MissingTestCoverage", "description": "A test that could have detected the issue was missing"}, {"name": "UnitTest", "description": "See child's description", "children": [{"name": "Bug", "description": "A Unit test that could have detected the issue has a bug"}, {"name": "Missing", "description": "A Unit test that could have detected the issue was missing"}, {"name": "StandardsGap", "description": "A unit test that could have detected the issue has standards gap"}]}]}]}, {"name": "Load", "description": "Any issue caused by the service not being able to handle changes in load", "children": [{"name": "Config", "description": "See child's description", "children": [{"name": "Scaling", "description": "The outage was caused because the service to fetch the configuration could not handle the load and it failed causing the outage. "}]}, {"name": "DOS", "description": "An issue related to a condition where increased load results in a Denial of Service"}, {"name": "Inrush", "description": "An issue related to the sudden increase in load, but not sustained load", "children": [{"name": "SingleCustomer", "description": "An issue related to the sudden increase in load caused by a single customer, but not sustained load"}]}, {"name": "LackOFCapacity", "description": "The service lacked capacity to handle load"}, {"name": "RetryImplemenation", "description": "The service did not have an adequate retry strategy or implementation for when client's retry requests against it"}, {"name": "Scaling", "description": "Related to increasing or decreasing capacity according to load", "children": [{"name": "AutoscaleInsufficient", "description": "The service's current autoscaling practice or functionality is not sufficient to handle increasing load"}, {"name": "NoAutoscale", "description": "The service does not automatically increase capacity when subject to increasing load"}]}, {"name": "Throttling", "description": "The service does not properly throttle incoming requests, or does not behave properly when being throttled", "children": [{"name": "BucketPerOperation", "description": "All operations MUST expose a normalized resource cost."}, {"name": "MissingDetection", "description": "The service lacked telemetry to know when it was throttling or being throttled"}, {"name": "NoisyNeighbor", "description": "Excess load from one tenant negatively impacted another tenant despite having throttling"}, {"name": "NonStandardApproach", "description": "Current throttling mechanism is not a token bucket based algorithm or is otherwise not developed using proven practices"}, {"name": "NoOverride", "description": "All services MUST be able to override throttling behavior, to handle inrush (slowly dialing up overall capacity during recovery conditions), with specific capabilities for whitelisting/blacklisting operations and users/tenants/subscriptions/etc. via direct token replenishment or bypassing quota enforcement"}, {"name": "NoSelectiveThrottling", "description": "Services need to be aware of upstream calling patterns, and whether successful user outcomes require a minimum sequence of operations.   "}, {"name": "NoThrottling", "description": "The service does not have any throttling of incoming requests"}, {"name": "PunitiveThrottling​", "description": "All services MUST be able to handle non-uniformity in their user facing throttling scopes, in an appropriately scalable and manageable fashion"}, {"name": "ScopesNotAlignedWithBlastRadius​​", "description": "All services need to align throttling scopes against the throttling blast radius to minimize impact of noisy neighbors, even within an individual customer scope (e.g. a single misbehaved script cannot lock a customer out of management of an entire subscription). "}, {"name": "TarPit", "description": "Services must NOT implement “tar pit” throttling approaches, where they delay response for a period of time in order to reduce the volume of incoming work (or hold processing the request until the throttling period has passed).  Instead, services must be prepared to immediately respond with the appropriate throttling codes (e.g. 429) on a transient or enduring basis (blacklisting).  "}, {"name": "Throttled", "description": "The service was throttled, and did not handle it correctly"}, {"name": "ThrottlingInsufficient", "description": "The service has throttling, but it is insufficient and there can be or was impact"}, {"name": "WrongResponseCode", "description": "The service is not sending the correct response code when it is throttled or throttling clients"}]}]}, {"name": "Performance", "description": "An issue that caused excess latency", "children": [{"name": "Caching", "description": "An issue related to how the service caches, but not an architectural limitation."}, {"name": "Config", "description": "See child's description", "children": [{"name": "Latency", "description": "A configuration issue contributed to increased latency"}]}, {"name": "CPU", "description": "An issue related to CPU usage with the current code"}, {"name": "Database", "description": "An issue related to Database usage with the current code"}, {"name": "DiskIO", "description": "An issue related to DiskIO usage with the current code"}, {"name": "Java", "description": "An issue related to Java usage with the current code"}, {"name": "Memory", "description": "An issue related to Memory usage with the current code"}, {"name": "Ports", "description": "An issue related to Ports usage with the current code"}, {"name": "Threads", "description": "An issue related to Threads usage with the current code"}]}, {"name": "Process", "description": "Any issue where a process existed and that process or the lack of a process was a contributing factor", "children": [{"name": "AccidentalDelete", "description": "A non-manual touch process was used to delete something, like a resource"}, {"name": "AzureDisasterRecoveryDrill", "description": "An issue related to an Azure Disaster Recovery Drill"}, {"name": "Communication", "description": "A communication ISSUE contributed to a non-optimal TTM or otherwise affected the ability to resolve the issue in a timeline manner"}, {"name": "CommunicationGap", "description": "A communication GAP contributed to a non-optimal TTM or otherwise affected the ability to resolve the issue in a timeline manner"}, {"name": "Deprecation", "description": "An issue related to the process followed during deprecation"}, {"name": "DRITraining", "description": "An issue related to the process used for Designated Responsible Individual (DRI) Training, the quality of the training, or the lack of training", "children": [{"name": "LackofTools", "description": "An issue related to the lack of tools that could have replaced the need for Designated Responsible Individual (DRI) Training, or an issue related to training on that tool"}]}, {"name": "EngDesign", "description": "An issue related to the process a team follows for engineering"}, {"name": "Gameday", "description": "An issue related to the process followed to prevent \"Game Day\" or  possibly \"High Priority Events\" from having impact"}, {"name": "KnowledgeGap", "description": "There was a knowledge gap that prevented successful execution of a process"}, {"name": "LeapYear", "description": "An issue related to the process used to detect, mitigate or prevent problems arising during leap years or leap seconds."}, {"name": "LongRecovery", "description": "An issue related to a process that resulted in a long recovery, or could have been further optimized"}, {"name": "Maintenance", "description": "An issue related to the process followed during Maintenance"}, {"name": "ManualRollover", "description": "See child's description", "children": [{"name": "Cert", "description": "An issue related to the process used to manually roll over a cert"}]}, {"name": "ManualTouch", "description": "There was a manual touch made during what should normally be a no touch process", "children": [{"name": "AccidentalDelete", "description": "A manual touch was used to delete something, like a resource"}, {"name": "Change", "description": "An issue related to a change in the way manual touches are made"}]}, {"name": "Migration", "description": "An issue related to the process followed for a migration of various types", "children": [{"name": "MissedStep", "description": "An issue related to a missing step in the process followed for a migration of various types"}]}, {"name": "MigrationNotCompleted", "description": "An issue related to migration not completed"}, {"name": "NoFly", "description": "An issue related to the process followed for, or the No Fly information itself"}, {"name": "NoGenevaAction", "description": "An issue related to no Geneva Action"}, {"name": "OpsTool", "description": "Used to note the use of an OpsTool.  Whether or not it is approved or not approved for Compliant Automated Touches is not considered"}, {"name": "Other", "description": "We don't need this.  Just \"Process\" works…and having \"Other breaks our model of having folks just suggest something."}, {"name": "Permissions", "description": "An issue related to the process used to add, remove, update or delete permissions "}, {"name": "Portal", "description": "An issue related to the process used to access and use the Azure Portal"}, {"name": "PostmortemLowQuality", "description": "The postmortem being analyzed is low quality as defined by the Postmortem Quality Review program"}, {"name": "PreMortem", "description": "Used to indicate where doing a premortem/Risk Threat Model could have helped"}, {"name": "ReleaseGate ", "description": "An issue related to the process followed by release gates"}, {"name": "SafeFly", "description": "An issue related to the process followed for, or the Safe Fly information itself"}, {"name": "SPC", "description": "An issue related to lack of a Safe Production Change"}]}]}